[
    {
        "name": "Mars 2020 Perseverance",
        "rocketID": 2,
        "siteID": 3,
        "launchTime": 1596109802,
        "craft": "541 Config",
        "id": 51612,
        "description": "The Mars 2020 mission with its Perseverance rover is part of NASA's Mars Exploration Program, a long-term effort of robotic exploration of the Red Planet. The Mars 2020 mission addresses high-priority science goals for Mars exploration, including key Astrobiology questions about the potential for life on Mars. The mission takes the next step by not only seeking signs of habitable conditions on Mars in the ancient past, but also searching for signs of past microbial life itself. The Perseverance rover introduces a drill that can collect core samples of the most promising rocks and soils and set them aside in a 'cache' on the surface of Mars. A future mission could potentially return these samples  to Earth.  That would help scientists study the samples in laboratories with special room-sized equipment that would be too large to take to Mars. The mission also provides opportunities to gather knowledge and demonstrate technologies that address the challenges of future human expeditions to Mars. These include testing a method for producing oxygen from the Martian atmosphere, identifying other resources (such as subsurface water), improving landing techniques, and characterizing weather, dust, and other potential environmental conditions that could affect future astronauts living and working on Mars.\n\nThe mission is timed for a launch opportunity in July 2020 when Earth and Mars are in good positions relative to each other for landing on Mars. That is, it takes less power to travel to Mars at this time, compared to other times when Earth and Mars are in different positions in their orbits. To keep mission costs and risks as low as possible, the Mars 2020 design is based on NASA's successful Mars Science Laboratory mission architecture, including its Curiosity rover and proven landing system.\n\nLaunch is still on schedule and the Mars 2020 team is working hard to get the Perseverance rover to the launch pad.  Check the Kennedy Space Center Visitor Complex for hours and/or any restrictions.  If you plan to attend in person, consider making refundable travel reservations.\n\nThe first launch opportunity begins at 6:35 a.m. PDT/ 9:35 a.m. EDT on July 22\n\nThe launch period is approximately three weeks, from July 22 to August 11. The duration of the daily launch window varies from day to day. The launch windows will last approximately two hours, with a unique launch opportunity every five minutes.\n\nThe Mars 2020 spacecraft with its Perseverance Rover will launch on an Atlas V-541 rocket from Launch Complex 41 at Cape Canaveral Air Force Station, Florida.  The Atlas V is one of the largest rockets available for interplanetary flight.  This is the same type of rocket that launched the InSight and Curiosity to Mars.  The launch vehicle is provided by United Launch Alliance, Centennial Colorado.(Source: NASA)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula_mars2020.png",
        "crewed": "",
        "replayURL": "https://youtu.be/JIB3JbIIbPU?t=2855",
        "outcome": 0,
        "orbit": "HTO"
    },
    {
        "name": "ANASIS-II",
        "rocketID": 0,
        "siteID": 0,
        "launchTime": 1595280600,
        "craft": "1058.2",
        "id": 1595280600,
        "description": "SpaceX is targeting Monday, July 20 for Falcon 9’s launch of the ANASIS-II mission, which will lift off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station in Florida. The primary launch window opens at 5:00 p.m. EDT, or 21:00 UTC, and closes at 8:55 p.m. EDT, or 00:55 UTC on July 21. A backup launch opportunity is available on Tuesday, July 21 that opens at 5:00 p.m. EDT, or 21:00 UTC, and closes at 8:55 p.m. EDT, or 00:55 UTC on July 22.\n\nFalcon 9’s first stage previously launched Crew Dragon to the International Space Station with NASA astronauts Bob Behnken and Doug Hurley on board. Following stage separation, SpaceX will land Falcon 9’s first stage on the 'Just Read the Instructions' droneship, which will be stationed in the Atlantic Ocean. The ANASIS-II spacecraft will deploy about 32 minutes after liftoff.",
        "recoveryStatus": "Complete",
        "destination": "Just Read the Instructions",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_07_2020_anasis.png",
        "crewed": "",
        "replayURL": "https://www.youtube.com/watch?v=TshvZlQ7le8",
        "outcome": 0,
        "orbit": "GTO"
    },
    {
        "name": "Pics Or It Didn't Happen",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1593897549,
        "craft": "Curie",
        "id": 1593897549,
        "description": "Mission Failure Statement: \n\nAn issue was experienced today during Rocket Lab's launch that caused the loss of the vehicle. We are deeply sorry to the customers on board Electron. The issue occurred late in the flight during the 2nd stage burn. More information will be provided as it becomes available.\n(@RocketLab via Twitter)\n\n\nOrignal Mission Objective:\n\n‘Pics Or It Didn’t Happen’ will deploy seven small satellites to a 500km circular low Earth orbit for a range of customers including Spaceflight Inc.’s customer Canon Electronics, as well as Planet and In-Space Missions.\n\nThe primary payload aboard this mission, Canon Electronics Inc.’s CE-SAT-IB, was procured by satellite rideshare and mission management provider Spaceflight Inc. The mission objective for the CE-SAT-IB satellite is to demonstrate Canon Electronics Inc.’s Earth-imaging technology with high-resolution and wide-angle cameras, as well as test the microsatellite for mass production.\n\nThe next five spacecraft manifested for this mission are the latest generation of SuperDove satellites manufactured by Planet, operator of the world’s largest constellation of Earth-observation satellites. Planet’s satellites are capable of imaging the Earth’s entire landmass on a near-daily basis. This unprecedented dataset helps researchers, students, businesses and governments discover patterns, detect early signals of change, and make timely, informed decisions. These five SuperDoves, Flock 4e, are equipped with new sensors to enable higher image quality with sharper, more vibrant colors and accurate surface reflectance values for advanced algorithms and time-series analysis.\n\nThe final spacecraft aboard Electron for this mission has been supplied by British small mission prime, In-Space Missions. The Faraday-1 6U CubeSat is a hosted payload mission providing a low-cost route to orbit for start-ups, institutions, and large corporate R&D groups.  In addition, it provides a first flight demonstration of In-Space’s own software-defined payload that will enable uploadable payload capabilities on future missions\n\n(Source: Rocket Lab)",
        "recoveryStatus": "In Development",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_13.png",
        "crewed": "",
        "replayURL": "https://www.youtube.com/watch?v=5ZcZoDFYjXc",
        "outcome": 1,
        "orbit": "LEO"
    },
    {
        "name": "GPS III SV03",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1593547846,
        "craft": "1060.1",
        "id": 1593547846,
        "description": "SpaceX is targeting Tuesday, June 30 for a Falcon 9 launch of the GPS III Space Vehicle 03 mission from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station in Florida. The 15-minute primary launch window opens at 3:55 p.m. EDT, 19:55 UTC, and a backup opportunity is available on Wednesday, July 1 with a 15-minute launch window opening at 3:51 p.m. EDT, 19:51 UTC. \n \nFollowing stage separation, SpaceX will land Falcon 9’s first stage on the “Just Read the Instructions” droneship, which will be stationed in the Atlantic Ocean. The spacecraft will deploy approximately 1 hour and 29 minutes after liftoff. \n \nThis will be the third launch in GPS Block III, helping keep the Global Positioning System fully operational. The GPS satellite was developed by Lockheed Martin. GPS Block III was originated by the the Clinton Administration in 1998. SpaceX successfully landed the booster!",
        "recoveryStatus": "Complete",
        "destination": "Just Read the Instructions",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_06_2020_gps3.png",
        "crewed": "",
        "replayURL": "https://youtu.be/6zr0nfG3Xy4?t=898",
        "outcome": 0,
        "orbit": "MEO"
    },
    {
        "name": "Starlink 8/Planet Labs SkySat",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1592040060,
        "craft": "1059.3",
        "id": 9999,
        "description": "SpaceX is targeting Saturday, June 13 at 5:21 a.m. EDT, 9:21 UTC, for launch of its ninth Starlink mission, which will include 58 Starlink satellites and three of Planet’s SkySats. Falcon 9 will lift off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, and a backup opportunity is available on Sunday, June 14 at 4:59 a.m. EDT, 8:59 UTC. This mission marks SpaceX’s first SmallSat Rideshare Program launch. \n \nFalcon 9’s first stage previously supported Dragon’s 19th and 20th resupply missions to the International Space Station. Following stage separation, SpaceX will land Falcon 9’s first stage on the 'Of Course I Still Love You' droneship, which will be stationed in the Atlantic Ocean. Half of Falcon 9’s fairing previously flew on the JCSAT-18/Kacific1 mission, and the other half previously flew on SpaceX’s third Starlink mission. (SpaceX)",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/8riKQXChPGg?t=833",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
           "name": "Don't Stop Me Now",
           "rocketID": 1,
           "siteID": 2,
           "launchTime": 1592025120,
           "craft": "",
           "id": 1592025120,
           "description": "'Don't Stop Me Now' was a rideshare mission that launched several small satellites, including the ANDESITE (Ad-Hoc Network Demonstration for Extended Satellite-Based Inquiry and Other Team Endeavors) satellite created by electrical and mechanical engineering students and professors at Boston University. The satellite launched as part of NASA’s CubeSat Launch Initiative (CSLI) and will conduct groundbreaking scientific study into Earth’s magnetic field. Once in space, the ANDESITE satellite will initiate measurements of the magnetosphere with onboard sensors, later releasing eight pico satellites carrying small magnetometer sensors to track electric currents flowing in and out of the atmosphere, a phenomenon also known as space weather. These variations in the electrical activity racing through space can have a big impact on our lives here on Earth, causing interruptions to things like radio communications and electrical systems. The ANDESITE satellite follows on from Rocket Lab’s first ELaNa (Educational Launch of Nanosatellites) launch for NASA, the ELaNa-19 mission, which launched a host of educational satellites to orbit on Electron in December 2018.\n\nThe mission also carried three payloads designed, built and operated by the NRO. The mission was procured under the agency’s Rapid Acquisition of a Small Rocket (RASR) contract vehicle. RASR allows the NRO to explore new launch opportunities that provide a streamlined, commercial approach for getting small satellites into space, as well as provide those working in the small satellite community with timely and cost-effective access to space. This mission followed Rocket Lab’s first dedicated mission for the NRO, Birds of a Feather, which was launched on 31 January 2020 NZT from Rocket Lab Launch Complex 1.\n\nThe ANDESITE and NRO payloads were joined on the mission by the M2 Pathfinder satellite, a collaboration between the University of New South Wales (UNSW) Canberra Space and the Australian Government. The M2 Pathfinder will test communications architecture and other technologies that will assist in informing the future space capabilities of Australia. The satellite will demonstrate the ability of an onboard software-based radio to operate and reconfigure while in orbit.\n\nThe mission was been named ‘Don’t Stop Me Now’ in recognition of Rocket Lab board member and avid Queen fan Scott Smith, who recently passed away. (Rocket Lab)",
           "recoveryStatus": "🚫",
           "destination": "",
           "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_12.png",
           "crewed": "",
           "replayURL": "https://youtu.be/VRfm6RGVHf8?t=748",
           "outcome": 0,
           "orbit": "LEO"
    },
    {
        "name": "Starlink 7",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1591233900,
        "craft": "1049.5",
        "id": 9998,
        "description": "SpaceX is targeting Wednesday June 3 at 9:25 p.m. EDT, 1:25 UTC on June 4, for its eighth launch of Starlink satellites. Falcon 9 will lift off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station. A backup opportunity is available on Thursday, June 4 at 9:03 p.m. EDT, 1:03 UTC on June 5. \n \nFalcon 9’s first stage previously supported the Telstar 18 VANTAGE mission in September 2018, the Iridium-8 mission in January 2019, and two separate Starlink missions in May 2019 and in January 2020. Following stage separation, SpaceX will land Falcon 9’s first stage on the 'Just Read the Instructions' droneship, which will be stationed in the Atlantic Ocean. \n \nThe Starlink satellites will deploy in an elliptical orbit approximately 15 minutes after liftoff. Prior to orbit raise, SpaceX engineers will conduct data reviews to ensure all Starlink satellites are operating as intended. Once the checkouts are complete, the satellites will then use their onboard ion thrusters to move into their intended orbits and operational altitude of 550 km.",
        "recoveryStatus": "Complete",
        "destination": "Just Read the Instructions",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/y4xBFHjkUvw?t=833",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Crew Dragon Demo-2",
        "rocketID": 0,
        "siteID": 0,
        "launchTime": 1590866565,
        "craft": "1058.1",
        "id": 9997,
        "description": "Crew Dragon Demo-2 (officially Crew Demo-2, SpaceX Demo-2, or Dragon Crew Demo-2) is a crewed test flight of the Crew Dragon spacecraft, which launched on 30 May 2020 at 19:22:45 UTC. Demo-2 is the first crewed orbital spaceflight launched from the United States since the final Space Shuttle mission, STS-135, in 2011, and also the first ever operated by a commercial provider. The mission, which launched spacecraft commander Douglas Hurley and joint-operations commander Robert Behnken to the International Space Station, is also the first two-person orbital spaceflight launched from the United States since STS-4 in 1982. The spacecraft soft docked with the International Space Station on 10:16 a.m. EDT (14:16 UTC) on 31 May 2020. Following soft capture, 12 hooks were closed to complete a hard capture at 10:27 a.m. EDT (14:27 UTC). The first attempt to launch on 27 May 2020 was aborted due to bad weather caused by Tropical Storm Bertha 16 minutes and 53 seconds prior to launch.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/Crew_Dragon_Demo-2_Patch.png",
        "crewed": "👨🏼‍🚀👩🏼‍🚀",
        "replayURL": "https://youtu.be/xY96v0OIcK4?t=15705",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Starlink 6",
        "rocketID": 0,
        "siteID": 0,
        "launchTime": 1587583800,
        "craft": "1051.4",
        "id": 9996,
        "description": "SpaceX is targeting Wednesday, April 22 at 3:30 p.m. EDT, or 19:30 p.m. UTC, for its seventh launch of Starlink satellites. Falcon 9 will lift off from Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center in Florida. A backup opportunity is available on Thursday, April 23 at 3:15 p.m. EDT, or 19:15 UTC. \n \nFalcon 9’s first stage previously supported Crew Dragon’s first flight to the International Space Station, launch of the RADARSAT Constellation Mission, and the fourth Starlink mission. Following stage separation, SpaceX will land Falcon 9’s first stage on the 'Of Course I Still Love You' droneship, which will be stationed in the Atlantic Ocean. Falcon 9’s fairing previously supported the AMOS-17 mission.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/wSge0I7pwFI?t=842",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Starlink 5",
        "rocketID": 0,
        "siteID": 0,
        "launchTime": 1584533760,
        "craft": "1048.5",
        "id": 9995,
        "description": "SpaceX is targeting Wednesday, March 18 at 8:16 a.m. EDT, or 12:16 UTC, for its sixth launch of Starlink satellites. Falcon 9 will lift off from Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center in Florida, with a backup opportunity on Thursday, March 19 at 7:56 a.m. EDT, or 11:56 UTC. \n \nFalcon 9’s first stage supported the Iridium-7 NEXT mission in July 2018, the SAOCOM 1A mission in October 2018, the Nusantara Satu mission in February 2019, and the second launch of Starlink in November 2019. Following stage separation, SpaceX will land Falcon 9’s first stage on the 'Of Course I Still Love You' droneship, which will be stationed in the Atlantic Ocean. Falcon 9’s fairing previously supported the first launch of Starlink in May 2019. Approximately 45 minutes after liftoff, SpaceX’s fairing recovery vessels, 'Ms. Tree' and 'Ms. Chief,' will attempt to recover the two fairing halves.",
        "recoveryStatus": "Failure",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/I4sMhHbHYXM?t=832",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "CRS-20",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1583556600,
        "craft": "1059.2",
        "id": 9994,
        "description": "SpaceX is targeting Friday, March 6 for launch of its twentieth Commercial Resupply Services mission (CRS-20), which will launch from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. Launch is targeted for 11:50 p.m. EST, or 4:50 UTC on Saturday, March 7. Dragon will separate from Falcon 9’s second stage about nine minutes after liftoff and attach to the space station on Monday, March 9. A backup launch opportunity is available on Saturday, March 7 at 11:27 p.m. EST, or 4:27 UTC on Sunday, March 8. \n \nThe Dragon spacecraft that will support the CRS-20 mission previously supported the CRS-10 mission in February 2017 and the CRS-16 mission in December 2018, and the Falcon 9 first stage booster supporting this mission previously flew on the CRS-19 mission in December 2019. Following stage separation, SpaceX will recover Falcon 9’s first stage on Landing Zone-1 (LZ-1) at Cape Canaveral Air Force Station, Florida.",
        "recoveryStatus": "Complete",
        "destination": "Landing Zone 1",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_crs20.png",
        "crewed": "",
        "replayURL": "https://youtu.be/1MkcWK2PnsU?t=1136",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Starlink 4",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1581951900,
        "craft": "1056.4",
        "id": 9993,
        "description": "SpaceX is targeting Monday, February 17 at 10:05 a.m. EST, or 15:05 UTC, for its fifth launch of Starlink satellites from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. A backup launch opportunity is available on Tuesday, February 18 at 9:42 a.m. EST, or 14:42 UTC. \n \nFalcon 9’s first stage previously launched the CRS-17 mission in May 2019, the CRS-18 mission in July 2019, and the JCSAT-18/Kacific1 mission in December 2019. Following stage separation, SpaceX will land Falcon 9’s first stage on the “Of Course I Still Love You” droneship, which will be stationed in the Atlantic Ocean. Approximately 45 minutes after liftoff, SpaceX’s two fairing recovery vessels, “Ms. Tree” and “Ms. Chief,” will attempt to recover the two fairing halves.",
        "recoveryStatus": "Failure",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/8xeX62mLcf8?t=539",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
           "name": "Birds of a Feather",
           "rocketID": 1,
           "siteID": 2,
           "launchTime": 1580439360,
           "craft": "",
           "id": 1580439360,
           "description": "Rocket Lab's 11th Electron flight - Birds of a Feather - launched a dedicated mission for the United States National Reconnaissance Office (NRO). The mission successfully lifted off from Rocket Lab Launch Complex 1 at 15:56 NZDT, 31 January 2020.\n\nThe NRO competitively awarded the contract under the Rapid Acquisition of a Small Rocket (RASR) contract vehicle. RASR allows the NRO to explore new launch opportunities that can provide a streamlined, commercial approach for getting small satellites into space. (Rocket Lab)",
           "recoveryStatus": "In Development",
           "destination": "",
           "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_11.png",
           "crewed": "",
           "replayURL": "https://youtu.be/af-PplDIkbc?t=841",
           "outcome": 0,
           "orbit": "LEO"
    },
    {
        "name": "Starlink 3",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1580306940,
        "craft": "1051.3",
        "id": 9992,
        "description": "SpaceX is targeting Wednesday, January 29 at 9:09 a.m. EST, or 14:09 UTC, for its fourth launch of Starlink satellites from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. \n \nFalcon 9’s first stage previously launched Crew Dragon on its first demonstration mission in March 2019 and the RADARSAT Constellation Mission in June 2019. Following stage separation, SpaceX will land Falcon 9’s first stage on the “Of Course I Still Love You” droneship, which will be stationed in the Atlantic Ocean. Approximately 45 minutes after liftoff, SpaceX’s two fairing recovery vessels, “Ms. Tree” and “Ms. Chief,” will attempt to recover the two fairing halves.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/1KmBDCiL7MU?t=628",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Crew Dragon In-Flight Abort Test",
        "rocketID": 0,
        "siteID": 0,
        "launchTime": 1579447800,
        "craft": "1046.4",
        "id": 9991,
        "description": "SpaceX is targeting Sunday, January 19 for an in-flight test of Crew Dragon’s launch escape capabilities from Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center in Florida. This test, which does not have NASA astronauts onboard the spacecraft, is intended to demonstrate Crew Dragon’s ability to reliably carry crew to safety in the unlikely event of an emergency on ascent. \n \nThe six-hour test window opens at 8:00 a.m. EST, or 13:00 UTC. A backup opportunity with the same six-hour launch window opening at 8:00 a.m. EST, or 13:00 UTC, is available on Monday, January 20.",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_ifa.png",
        "crewed": "",
        "replayURL": "https://youtu.be/mhrkdHshb3E?t=1017",
        "outcome": 0,
        "orbit": "IFA"
    },
    {
        "name": "Starlink 2",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1578363540,
        "craft": "1049.4",
        "id": 9990,
        "description": "SpaceX is targeting Monday, January 6 at 9:19 p.m. EST, or 2:19 UTC on January 7, for its third launch of Starlink satellites from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. A backup launch opportunity is available on Tuesday, January 7 at 8:57 p.m. EST, or 1:57 UTC on January 8. \n \nFalcon 9’s first stage supported a Starlink mission in May 2019, the Iridium-8 mission in January 2019, and the Telstar 18 VANTAGE mission in September 2018. Following stage separation, SpaceX will land Falcon 9’s first stage on the “Of Course I Still Love You” droneship, which will be stationed in the Atlantic Ocean. Approximately 45 minutes after liftoff, SpaceX’s fairing recovery vessel, “Ms. Tree,” will attempt to recover a payload fairing half.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/HwyXo6T7jC4?t=660",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "JCSAT-18/Kacific1",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1576541400,
        "craft": "1056.3",
        "id": 1576541400,
        "description": "SpaceX is targeting Monday, December 16 for launch of JCSAT-18/Kacific1 from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. The launch window opens at 7:10 p.m EST, or 00:10 UTC on December 17, and closes at 8:38 p.m. EST, 01:38 UTC on December 17. A backup launch window is available on Tuesday, December 17 that opens at 7:10 p.m EST, or 00:10 UTC on December 18, and closes at 8:38 p.m. EST, 01:38 UTC on December 18. The satellite will be deployed at approximately 33 minutes after liftoff. \n \nFalcon 9’s first stage for the JCSAT-18/Kacific1 mission previously supported the CRS-17 mission in May 2019 and the CRS-18 mission in July 2019. Following stage separation, SpaceX will land Falcon 9’s first stage on the “Of Course I Still Love You” droneship, which will be stationed in the Atlantic Ocean. Approximately 45 minutes after liftoff, SpaceX’s two fairing recovery vessels, “Ms. Tree” and “Ms. Chief,” will attempt to recover the two fairing halves.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/sbXgZg9JmkI?t=718",
        "outcome": 0,
        "orbit": "GTO"
    },
    {
           "name": "Running Out Of Fingers",
           "rocketID": 1,
           "siteID": 2,
           "launchTime": 1575620280,
           "craft": "Curie",
           "id": 1575620280,
           "description": "Onboard this rideshare mission were six spacecraft comprised of 5cm PocketQube microsatellites from satellite manufacturer and mission management provider Alba Orbital. The final payload on board was procured by satellite rideshare and mission management provider Spaceflight for ALE Co., Ltd (ALE), a Tokyo-based company creating microsatellites that simulate meteor particles.\n\n‘Running Out Of Fingers’ also included the first guided, full telemetry re-entry of the Electron launch vehicle’s first stage as part of Rocket Lab’s plans to re-use and re-fly rocket boosters in future missions. Recovery instrumentation on-board this flight included guidance and navigation hardware, including S-band telemetry and on-board flight computer systems, to live-gather data during the first stage’s atmospheric re-entry, as well as a reaction control system to orient the booster. (Rocket Lab)",
           "recoveryStatus": "In Development",
           "destination": "",
           "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_10.png",
           "crewed": "",
           "replayURL": "https://youtu.be/QK9mQdar5_w?t=926",
           "outcome": 0,
           "orbit": "LEO"
    },
    {
        "name": "CRS-19",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1575566940,
        "craft": "1059.1",
        "id": 1575566940,
        "description": "SpaceX is targeting Thursday, December 5 for launch of its nineteenth Commercial Resupply Services mission (CRS-19) at 12:29 p.m. EST, or 17:29 UTC, from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. Dragon will separate from Falcon 9’s second stage about nine minutes after liftoff and attach to the space station on Saturday, December 7. \n \nThe Dragon spacecraft that will support the CRS-19 mission previously supported the CRS-4 mission in September 2014 and the CRS-11 mission in June 2017. Following stage separation, SpaceX will attempt to recover Falcon 9’s first stage on the Of Course I Still Love You droneship, which will be stationed in the Atlantic Ocean.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/-aoAGdYXp_4?t=839",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Starlink 1",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1573484160,
        "craft": "1048.4",
        "id": 1573484160,
        "description": "SpaceX is targeting Monday, November 11 at 9:56 a.m. EST, 14:56 UTC, for launch of 60 Starlink satellites from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. A backup launch opportunity is available at 9:34 a.m. EST, 14:34 UTC, on Tuesday, November 12. \n \nFalcon 9’s first stage supported the Iridium-7, SAOCOM-1A, and Nusantara Satu missions, and the fairing was previously flown on Falcon Heavy’s Arabsat-6A mission earlier this year. Following stage separation, SpaceX will land Falcon 9’s first stage on the “Of Course I Still Love You” droneship, which will be stationed in the Atlantic Ocean.",
        "recoveryStatus": "Complete",
        "destination": "Of Course I Still Love You",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/pIDuv0Ta0XQ?t=839",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
           "name": "As The Crow Flies",
           "rocketID": 1,
           "siteID": 2,
           "launchTime": 1571275320,
           "craft": "Curie",
           "id": 1571275320,
           "description": "This mission lifted-off at 14:22 NZDT, 17th October 2019, from Rocket Lab's Launch Complex 1 on New Zealand’s Māhia Peninsula. Encapsulated in Electron’s fairing was a single spacecraft for Astro Digital, a California-based satellite manufacturer and operator.\n\nAstro Digital provides customers with complete space-based systems and mission support services for applications such as Earth observation, satellite communications, and technology demonstration.\n\nThis mission flew a Palisade technology demonstration satellite, a 16U CubeSat bus with on-board propulsion system, a next generation Astro Digital developed communications system, and software developed by Advanced Solutions Inc. including an advanced version of ASI’s MAX Flight Software.\n\nThe mission was named ‘As The Crow Flies’ in a nod to Astro Digital’s Corvus Platform, which provides flexible and cost-effective solutions across a wide range of applications and mission profiles on bus variants ranging from 6U and 16U CubeSats to ESPA Class. Corvus is also a widely-distributed genus of birds which includes crows. (Rocket Lab)",
           "recoveryStatus": "🚫",
           "destination": "",
           "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_09.png",
           "crewed": "",
           "replayURL": "https://youtu.be/gI_Ng4SGyUY?t=838",
           "outcome": 0,
           "orbit": "LEO"
    },
    {
           "name": "Look Ma, No Hands",
           "rocketID": 1,
           "siteID": 2,
           "launchTime": 1566216720,
           "craft": "",
           "id": 1566216720,
           "description": "Rocket Lab's eighth mission lifted-off on 19 August UTC from Launch Complex 1 in New Zealand, carrying a total of four satellites aboard an Electron launch vehicle.\n\nOn board were satellites destined to begin a new constellation for UNSEENLABS, as well as more rideshare payloads for Spaceflight, consisting of a spacecraft for BlackSky and the United States Air Force Space Command.\n\nThe mission launched a CubeSat that formed the cornerstone of a new maritime surveillance constellation for French company UNSEENLABS. The constellation aims to deliver precise, reliable, and secure maritime data, enabling organizations to monitor their own vessels and observe those that present risks, such as pirates and illegal vessels.\n\nMission management and rideshare aggregator, Spaceflight, also manifested three satellites on its second rideshare mission with Rocket Lab. Among the rideshare payloads was BlackSky’s Global-4 Earth-imaging satellite. The satellite joined BlackSky Global-3, which was launched to low Earth orbit on an Electron vehicle in June 2019. BlackSky’s constellation delivers rapid-revisit satellite imagery to assist with monitoring economic activity such as crop development and herd migration, or surveying damage following natural disasters.\n\nThe final spacecraft manifested on the mission were two experimental satellites for the United States Air Force Space Command, designed to test new technologies including propulsion, power, communications, and drag capabilities for potential applications on future spacecraft. (Rocket Lab)",
           "recoveryStatus": "🚫",
           "destination": "",
           "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_08.png",
           "crewed": "",
           "replayURL": "https://youtu.be/SNuauG1Gvr8?t=1034",
           "outcome": 0,
           "orbit": "LEO"
    },
    {
        "name": "AMOS-17",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1565131980,
        "craft": "1047.3",
        "id": 1565131980,
        "description": "SpaceX is targeting Tuesday, August 6 for launch of AMOS-17 from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. The launch window opens at 6:53 p.m. EDT, or 22:53 UTC, and closes at 8:21 p.m. EDT, or 00:21 UTC on August 7. The satellite will be deployed approximately 31 minutes after liftoff. \n \nFalcon 9’s first stage for the AMOS-17 mission previously supported the Telstar-19 VANTAGE mission in July 2018 and the Es’hail-2 mission in November 2018.",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/fZh82-WcCuo?t=1136",
        "outcome": 0,
        "orbit": "GTO"
    },
    {
        "name": "CRS-18",
        "rocketID": 0,
        "siteID": 1,
        "launchTime": 1564092060,
        "craft": "1056.2",
        "id": 1564092060,
        "description": "At 6:01 p.m. EDT, or 22:01 UTC, on Thursday, July 25, SpaceX launched its eighteenth Commercial Resupply Services mission (CRS-18) from Space Launch Complex 40 (SLC-40) at Cape Canaveral Air Force Station, Florida. Dragon separated from Falcon 9’s second stage about nine minutes after liftoff. \n \nThe Dragon spacecraft supporting the CRS-18 mission previously supported the CRS-6 mission in April 2015 and the CRS-13 mission in December 2017. Following stage separation, SpaceX recovered Falcon 9’s first stage on Landing Zone 1 (LZ-1) at Cape Canaveral Air Force Station, Florida.",
        "recoveryStatus": "Complete",
        "destination": "Landing Zone 1",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/SlgrxVuP5jk?t=839",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
           "name": "Make It Rain",
           "rocketID": 1,
           "siteID": 2,
           "launchTime": 1561782600,
           "craft": "",
           "id": 1561782600,
           "description": "The Make It Rain mission launched multiple spacecraft as part of a rideshare flight procured by Spaceflight. The launch took place from Rocket Lab Launch Complex 1 on New Zealand’s Māhia Peninsula.\n\nThe mission was named ‘Make it Rain’ in a nod to the high volume of rainfall in Seattle, where Spaceflight is headquartered, as well in New Zealand where Launch Complex 1 is located. Among the payloads on the mission for Spaceflight were BlackSky’s Global-3 satellite and Melbourne Space Program’s ACRUX-1 CubeSat. (Rocket Lab)",
           "recoveryStatus": "🚫",
           "destination": "",
           "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_07.png",
           "crewed": "",
           "replayURL": "https://youtu.be/idKCy8LdyKo?t=1076",
           "outcome": 0,
           "orbit": "LEO"
    },
    {
        "name": "STP-2",
        "rocketID": 4,
        "siteID": 0,
        "launchTime": 1561444200,
        "craft": "1057.1,1052.2,1053.2",
        "id": 1561444200,
        "description": "USAF Space Test Program Flight 2 (STP-2) carried 24 small satellites, including: FormoSat-7 A/B/C/D/E/F integrated using EELV Secondary Payload Adapter, DSX, Prox-1 GPIM, DSAC, ISAT, SET, COSMIC-2, Oculus-ASR, OBT, NPSat, and several CubeSats including E-TBEx, LightSail 2, TEPCE, PSAT, and three ELaNa 15 CubeSats. Total payload mass was 3,700 kg. The mission lasted six hours during which the second stage ignited four times and went into different orbits to deploy satellites including a 'propulsive passivation maneuver'.\n\nThe side boosters from the Arabsat-6A mission just 2.5 months before were reused on this flight and successfully returned to LZ-1 and LZ-2. The center core, in use for the first time, underwent the most energetic reentry attempted by SpaceX, and attempted a landing over 1,200 km (750 mi) downrange, 30% further than any previous landing. This core suffered a thrust vector control failure in the center engine caused by a breach in the engine bay due to the extreme heat. The core thus failed its landing attempt on the drone ship Of Course I Still Love You due to lack of control when the outer engines shut down. For the first time one fairing half was successfully landed on the catch-net of the support ship GO Ms. Tree (formerly Mr. Steven). (Wikipedia)",
        "recoveryStatus": "Failure",
        "recoveryStatus2": "Complete",
        "recoveryStatus3": "Complete",
        "recoveryStatusAll": "⚠️✅✅",
        "destination": "Of Course I Still Love You",
        "destination2": "Landing Zone 1",
        "destination3": "Landing Zone 2",
        "patchURL": "https://cdn.launchtrack.app/images/patches/sx_starlink.png",
        "crewed": "",
        "replayURL": "https://youtu.be/WxH4CAlhtiQ?t=1436",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "That's a Funny Looking Cactus",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1557036000,
        "craft": "",
        "id": 1557036000,
        "description": "The STP-27RD mission was Rocket Lab’s sixth mission and the company’s second launch of 2019. Lifting-off from Launch Complex 1, the mission lofted three research and development satellites for the U.S. Air Force's Space Test Program.\n\nThe Space Plug and Play Architecture Research CubeSat-1 (SPARC-1) payload, sponsored by the Air Force Research Laboratory Space Vehicles Directorate (AFRL/RV), was a joint Swedish-United States experiment to explore technology developments in avionics miniaturization, software defined radio systems, and space situational awareness (SSA).\n\nThe Falcon Orbital Debris Experiment (Falcon ODE), sponsored by the United States Air Force Academy, evaluated ground-based tracking of space objects.\n\nThe final payload was the 150kg Harbinger satellite; a commercial small satellite built by York Space Systems and sponsored by the U.S Army to demonstrate the ability of an experimental commercial system to meet DoD space capability requirements. (Rocket Lab)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_06.png",
        "crewed": "",
        "replayURL": "https://youtu.be/ahVDVWq_Ei4?t=950",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Two Thumbs Up",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1553815635,
        "craft": "Curie",
        "id": 1553815635,
        "description": "The DARPA R3D2 mission was Rocket Lab’s fifth mission and the company’s first launch of 2019.\n\nThe mission launched the R3D2 (Radio Frequency Risk Reduction Deployment Demonstration) payload for DARPA. R3D2 was a prototype reflect array antenna designed to improve radio communications in small spacecraft.\n\nThe R3D2 antenna, made of a tissue-thin Kapton membrane, packed tightly inside a small satellite for stowage during launch, before deploying to its full size of 2.25 meters in diameter once it reached low Earth orbit. By compacting a large antenna into a small satellite, the spacecraft can provide significant capability, negating the need for satellite owners to build large satellites that can only be launched as a ride-share payload on big rockets with significant price tags and lengthy delays.\n\nThe 150kg R3D2 satellite lifted off on an Electron rocket from Launch Complex 1 on New Zealand’s Māhia Peninsula and was deployed to a 425kmx425km orbit at 39.5 degrees by Electron’s Kick Stage, a nimble upper stage designed to insert payloads with precise accuracy before deorbiting itself and leaving no space junk behind. (Rocket Lab)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_05.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "USA-290 (NROL-71)",
        "rocketID": 3,
        "siteID": 7,
        "launchTime": 1547925000,
        "craft": "",
        "id": 1547925000,
        "description": "Classified payload",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol71.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "This One's For Pickering",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1544942026,
        "craft": "",
        "id": 4984896687,
        "description": "The ELaNa-19 mission for NASA (Educational Launch of Nanosatellites 19) was Rocket Lab’s fourth Electron launch and the company’s first mission for NASA. The mission saw Rocket Lab’s Electron launch vehicle loft 13 CubeSats to low Earth orbit.\n\nThe launch was significant for the small satellite industry as it was the first time NASA CubeSats will enjoyed a dedicated ride to orbit on a commercial launch vehicle, thanks to NASA’s forward-leaning Venture Class Launch Services (VCLS) initiative. (Rocket Lab)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_04.png",
        "crewed": "",
        "replayURL": "https://youtu.be/F7Kr3664hJs?t=950",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "It's Business Time",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1541908228,
        "craft": "Curie",
        "id": 4894891998,
        "description": "It's Business Time was Rocket Lab's third Electron launch. It's Business Time was manifested with commercial satellites from Spire Global, Tyvak Nano-Satellite Systems, Fleet Space Technologies, as well as an educational payload from the Irvine CubeSat STEM Program (ICSP) and a drag sail technology demonstrator designed and built by High Performance Space Structure Systems GmBH (HPS GmbH).\n\nThe payloads were launched to a 210km x 500km circular orbit at 85 degrees, before being circularized to 500 x 500 km using Rocket Lab’s Curie engine powered Kick Stage. (Rocket Lab)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_03.png",
        "crewed": "",
        "replayURL": "https://youtu.be/sPwMuUxSrcA?t=1137",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "Parker Solar Probe",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1534059060,
        "craft": "",
        "id": 1534059060,
        "description": "Only use of Delta IV Heavy with Star 48BV third stage (9255H). 8.5 solar radii (5.9 million km) perihelion. The Parker Solar Probe (abbreviated PSP) is a NASA robotic spacecraft launched in 2018 with the mission of making observations of the outer corona of the Sun. It will approach to within 9.86 solar radii (6.9 million km or 4.3 million miles) from the center of the Sun, and by 2025 will travel, at closest approach, as fast as 690,000 km/h (430,000 mph), or 0.064% the speed of light. (Wikipedia)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/parker.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "SUN"
    },
    {
        "name": "Still Testing",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1516502595,
        "craft": "",
        "id": 798165984,
        "description": "The Still Testing mission was Rocket Lab's first orbital launch of the Electron vehicle. Electron lifted-off at 14:43 NZDT from Rocket Lab Launch Complex 1 on the Māhia Peninsula in New Zealand on 21 January 2018. The launch marked the beginning of a new era in commercial access to space.\n\nStill Testing carried a Dove Pioneer Earth-imaging satellite for Planet, as well as two Lemur-2 satellites for weather and ship tracking company Spire. (Rocket Lab)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_02.png",
        "crewed": "",
        "replayURL": "https://youtu.be/eg5234BOED8?t=833",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "It's a Test",
        "rocketID": 1,
        "siteID": 2,
        "launchTime": 1495686045,
        "craft": "",
        "id": 94861545,
        "description": "It's a Test was the first launch of Rocket Lab's Electron launch vehicle. When Electron lifted-off at 16:20 NZT from Rocket Lab Launch Complex 1 on the Mahia Peninsula in New Zealand, it became the first orbital-class rocket launched from from a private launch site.\n\nThe mission saw Electron complete a perfect first stage burn, stage separation, second stage ignition and fairing separation. Electron successfully reached space and put Rocket Lab in an incredibly strong position to accelerate into commercial operations. (Rocket Lab)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/rl/rl_01.png",
        "crewed": "",
        "replayURL": "https://www.youtube.com/watch?v=VA_8HPsua0c",
        "outcome": 3,
        "orbit": "LEO"
    },
    {
        "name": "USA-268 (NROL-37)",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1465667460,
        "craft": "",
        "id": 1465667460,
        "description": "Reconnaissance satellite",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol37.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GSO"
    },
    {
        "name": "NASA EFT-1",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1417781100,
        "craft": "",
        "id": 1417781100,
        "description": "First Delta IV Heavy launch for NASA. The mission was a four-hour, two-orbit test of the Orion Multi-Purpose Crew Vehicle. The launch was delayed several hours due to weather and technical reasons. (Wikipedia)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/orion.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GSO"
    },
    {
        "name": "USA-245 (NROL-65)",
        "rocketID": 3,
        "siteID": 7,
        "launchTime": 1377712980,
        "craft": "",
        "id": 1377712980,
        "description": "Reconnaissance satellite",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol65.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GSO"
    },
    {
        "name": "USA-237 (NROL-15)",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1340975700,
        "craft": "",
        "id": 1340975700,
        "description": "ELINT satellite, flown with RS-68A engines.",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol15.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GSO"
    },
    {
        "name": "USA-224 (NROL-49)",
        "rocketID": 3,
        "siteID": 7,
        "launchTime": 1295557800,
        "craft": "",
        "id": 1295557800,
        "description": "First Delta IV Heavy launch from Vandenberg Air Force Base. The payload was a reconnaissance satellite for the United States government.",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol49.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "LEO"
    },
    {
        "name": "USA-223 (NROL-32)",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1290380280,
        "craft": "",
        "id": 1290380280,
        "description": "ELINT Satellite",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol32.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GEO"
    },
    {
        "name": "USA-202 (NROL-26)",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1232246820,
        "craft": "",
        "id": 1232246820,
        "description": "Reconnaissance satellite",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/nrol26.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GSO"
    },
    {
        "name": "DSP-23",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1194745800,
        "craft": "",
        "id": 1194745800,
        "description": "First Delta IV launch contracted by United Launch Alliance and first operational Delta IV Heavy launch. Launch delayed due to damage to launch pad caused by a liquid oxygen leak. Missile warning satellite. Spacecraft eventually stopped transmitting in September 2008. (Wikipedia)",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula/dsp23.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 0,
        "orbit": "GSO"
    },
    {
        "name": "DemoSat/3CS-1/3CS-2",
        "rocketID": 3,
        "siteID": 6,
        "launchTime": 1103665800,
        "craft": "",
        "id": 1103665800,
        "description": "Demonstration Payloads for the Delta IV Heavy's first flight. Performance was below expected, resulting in improper orbit insertion for the payloads. Considered a partial failure.",
        "recoveryStatus": "🚫",
        "destination": "",
        "patchURL": "https://cdn.launchtrack.app/images/patches/ula_base.png",
        "crewed": "",
        "replayURL": "",
        "outcome": 3,
        "orbit": "GSO"
    }
]
