[
    {
        "article": "Electron 'Pics Or It Didn't Happen' Mission fails to reach orbit",
        "tags": "Rocket Lab",
        "id": 1593950453,
        "postTime": 1593950453,
        "imageName": "sx_f9",
        "content": "From Rocket Lab\n\nLong Beach, Calif. July 4, 2020: Following a successful lift-off, first stage burn, and stage separation, Rocket Lab experienced an anomaly during its 13th Electron mission 'Pics Or It Didn't Happen.' \n\nThe issue occurred approximately four minutes into the flight on July 4, 2020 and resulted in the safe loss of the vehicle. As a result, the payloads onboard Electron were not deployed to orbit. Electron remained within the predicted launch corridors and caused no harm to personnel or the launch site. Rocket Lab is working closely with the FAA to investigate the anomaly and identify its root cause to correct the issue to move forward.\n\n'We are deeply sorry to our customers Spaceflight Inc., Canon Electronics Inc., Planet, and In-Space Missions for the loss of their payloads. We know many people poured their hearts and souls into those spacecraft. Today's anomaly is a reminder that space launch can be unforgiving, but we will identify the issue, rectify it, and be safely back on the pad as soon as possible,' said Peter Beck, Rocket Lab founder and CEO. 'The launch team operated with professionalism and expertise to implement systems and procedures that ensured the anomaly was managed safely. I'm proud of the way they have responded to a tough day. We're working together as a team to comb through the data, learn from today, and prepare for our next mission.'\n\nToday's anomaly occurred after 11 consecutive successful orbital launches of the Electron launch vehicle. Rocket Lab currently has more than eight Electron vehicles in production, ready for a rapid return to flight as soon as investigations are complete and any required corrective actions are in place.",
        "readMore": "https://www.rocketlabusa.com/news/updates/rocket-lab-mission-fails-to-reach-orbit/",
        "articleImageURL": "https://cdn.launchtrack.app/images/articles/gps3-3-landingJRTI.jpg",
        "launchID": 1593897549,
        "siteID": -99,
        "rocketID": 1
    },
    {
        "article": "Successful mission and landing for SpaceX GPS III SV03 Mission",
        "tags": "SpaceX",
        "id": 1593552949,
        "postTime": 1593552949,
        "imageName": "sx_f9",
        "content": "SpaceX has successfully completed the GPS III SV03 mission, deploying the United States Space Force's newest GPS satellite to the desired orbit. Additionally, Falcon 9 Booster 1060 landed on the Autonomous Spaceport Drone Ship (ASDS) 'Just Read the Instructions' (JRTI)!",
        "readMore": "",
        "articleImageURL": "https://cdn.launchtrack.app/images/articles/gps3-3-landingJRTI.jpg",
        "launchID": 1593547846,
        "siteID": -99,
        "rocketID": 0
    },
    {
        "article": "Welcome to LaunchTrack",
        "tags": "LaunchTrack",
        "id": 4564,
        "postTime": 1583017540,
        "imageName": "sx_f9",
        "content": "Welcome to LaunchTrack! We hope this app will suit your space-launch tracking needs. Enjoy the app and please, let us know if you want to see any changes! You can always reach us at support@launchtrack.app",
        "readMore": "https://launchtrack.app",
        "articleImageURL": "https://cdn.launchtrack.app/images/articles/space_landing_fh.jpg",
        "launchID": -99,
        "siteID": -99,
        "rocketID": -99
    }
]
